In [26]:
import numpy as np

In [27]:
import pandas as pd

In [28]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [29]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [30]:
dates = pd.date_range("20130101", periods=6)

In [31]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [32]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [33]:
df

                   A         B         C         D
2013-01-01  1.491723  0.256804 -0.685921 -0.629920
2013-01-02  0.268038 -0.444889  1.045088 -1.845407
2013-01-03 -0.859218  0.600395  0.169460  1.275468
2013-01-04  0.243672  0.069908  0.501439 -0.257155
2013-01-05 -0.019948 -0.178285  0.368858 -0.518098
2013-01-06  1.167787 -2.863889 -2.578397  1.291061

In [34]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [35]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [36]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [37]:
df.head()

                   A         B         C         D
2013-01-01  1.491723  0.256804 -0.685921 -0.629920
2013-01-02  0.268038 -0.444889  1.045088 -1.845407
2013-01-03 -0.859218  0.600395  0.169460  1.275468
2013-01-04  0.243672  0.069908  0.501439 -0.257155
2013-01-05 -0.019948 -0.178285  0.368858 -0.518098

In [38]:
df.tail()

                   A         B         C         D
2013-01-02  0.268038 -0.444889  1.045088 -1.845407
2013-01-03 -0.859218  0.600395  0.169460  1.275468
2013-01-04  0.243672  0.069908  0.501439 -0.257155
2013-01-05 -0.019948 -0.178285  0.368858 -0.518098
2013-01-06  1.167787 -2.863889 -2.578397  1.291061

In [39]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [40]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [41]:
df.to_numpy()

array([[ 1.49172329,  0.25680374, -0.68592065, -0.62991967],
       [ 0.26803783, -0.44488909,  1.04508771, -1.84540667],
       [-0.85921753,  0.60039531,  0.16946015,  1.27546844],
       [ 0.24367205,  0.06990845,  0.50143919, -0.25715454],
       [-0.01994758, -0.17828507,  0.36885818, -0.51809787],
       [ 1.1677866 , -2.86388868, -2.57839716,  1.29106088]])

In [42]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.382009 -0.426659 -0.196579 -0.114008
std    0.846552  1.246648  1.295776  1.212646
min   -0.859218 -2.863889 -2.578397 -1.845407
25%    0.045957 -0.378238 -0.472075 -0.601964
50%    0.255855 -0.054188  0.269159 -0.387626
75%    0.942849  0.210080  0.468294  0.892313
max    1.491723  0.600395  1.045088  1.291061

In [43]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.491723    0.268038   -0.859218    0.243672   -0.019948    1.167787
B    0.256804   -0.444889    0.600395    0.069908   -0.178285   -2.863889
C   -0.685921    1.045088    0.169460    0.501439    0.368858   -2.578397
D   -0.629920   -1.845407    1.275468   -0.257155   -0.518098    1.291061

In [44]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.629920 -0.685921  0.256804  1.491723
2013-01-02 -1.845407  1.045088 -0.444889  0.268038
2013-01-03  1.275468  0.169460  0.600395 -0.859218
2013-01-04 -0.257155  0.501439  0.069908  0.243672
2013-01-05 -0.518098  0.368858 -0.178285 -0.019948
2013-01-06  1.291061 -2.578397 -2.863889  1.167787

In [45]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-06  1.167787 -2.863889 -2.578397  1.291061
2013-01-02  0.268038 -0.444889  1.045088 -1.845407
2013-01-05 -0.019948 -0.178285  0.368858 -0.518098
2013-01-04  0.243672  0.069908  0.501439 -0.257155
2013-01-01  1.491723  0.256804 -0.685921 -0.629920
2013-01-03 -0.859218  0.600395  0.169460  1.275468

In [46]:
df["A"]

2013-01-01    1.491723
2013-01-02    0.268038
2013-01-03   -0.859218
2013-01-04    0.243672
2013-01-05   -0.019948
2013-01-06    1.167787
Freq: D, Name: A, dtype: float64

In [47]:
df[0:3]

                   A         B         C         D
2013-01-01  1.491723  0.256804 -0.685921 -0.629920
2013-01-02  0.268038 -0.444889  1.045088 -1.845407
2013-01-03 -0.859218  0.600395  0.169460  1.275468

In [48]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.268038 -0.444889  1.045088 -1.845407
2013-01-03 -0.859218  0.600395  0.169460  1.275468
2013-01-04  0.243672  0.069908  0.501439 -0.257155

In [49]:
df.loc[dates[0]]

A    1.491723
B    0.256804
C   -0.685921
D   -0.629920
Name: 2013-01-01 00:00:00, dtype: float64

In [50]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  1.491723  0.256804
2013-01-02  0.268038 -0.444889
2013-01-03 -0.859218  0.600395
2013-01-04  0.243672  0.069908
2013-01-05 -0.019948 -0.178285
2013-01-06  1.167787 -2.863889